#+title: albin's emacs configure
#+author: albin<albinyewen@gmail.com>

** truncate-lines
#+begin_src emacs-lisp
  (toggle-truncate-lines -1)
#+end_src

#+RESULTS:
: Truncate long lines disabled

** COMMENT 启动的时候就打开org agenda
#+begin_src emacs-lisp
  (org-agenda nil "n")
#+end_src

#+RESULTS:
| t | org-agenda-reset-markers |

** capture and agenda
#+begin_src emacs-lisp
  (setq org-capture-templates
        `(("i" "inbox" entry (file "~/org/inbox.org")
           "* TODO %?")
          ("p" "paper" entry (file "~/org/papers/papers.org")
           "* TODO %(jethro/trim-citation-title \"%:title\")\n%a" :immediate-finish t)
          ("e" "email" entry (file+headline "~/org/emails.org" "Emails")
           "* TODO [#A] Reply: %a :@home:@school:" :immediate-finish t)
          ("l" "link" entry (file "~/org/inbox.org")
           "* TODO %(org-cliplink-capture)" :immediate-finish t)
          ("z" "elfeed-link" entry (file "~/org/inbox.org")
           "* TODO %a\n" :immediate-finish t)
          ("w" "Weekly Review" entry (file+olp+datetree "~/org/reviews.org")
           (file "~/org/templates/weekly_review.org"))
          ("s" "Snippet" entry (file "~/org/deft/capture.org")
           "* Snippet %<%Y-%m-%d %H:%M>\n%?")))
  (global-set-key (kbd "H-s") 'org-capture)
#+end_src

#+RESULTS:
| p | paper | entry | (file ~/org/papers/papers.org) | * TODO %(jethro/trim-citation-title "%:title") |

** COMMENT emails
#+begin_src emacs-lisp
  (setq nnimap-sequence 1)
  (setq gnus-secondary-select-methods
        '(
          (nnimap "gmail"
                  (nnimap-address
                   "imap.gmail.com")
                  (nnimap-server-port 993)
                  (nnimap-stream ssl))
          ))

  (setq nnml-directory "~/staff_mail")
  (setq message-directory "~/staff_mail")
#+end_src

#+RESULTS:
: ~/staff_mail

*** COMMENT python
#+BEGIN_SRC emacs-lisp
  (add-hook 'python-mode-hook `(lambda () (lsp)))
#+END_SRC

#+RESULTS:
| (lambda nil (lsp)) | paredit-mode | doom-modeline-env-setup-python |


** shell
#+begin_src emacs-lisp
  (defun my-buffer-face-mode-fixed ()
     (interactive)
     (setq buffer-face-mode-face '(:family "DejaVu Sans Mono for Powerline"))
     (buffer-face-mode))

  (use-package multi-term
    :init
    (setq multi-term-program "/bin/zsh")
    :hook
    (shell-mode my-buffer-face-mode-fixed)
    :bind
    (
     ("C-H-<left>" . multi-term-prev)
     ("C-H-<right>" . multi-term-next)))
#+end_src

#+RESULTS:
| multi-term |

